#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.aws_ami.amazon_linux: Reading...
data.aws_region.current: Reading...
data.aws_route53_zone.zone: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_route53_zone.zone: Read complete after 1s [id=Z01104713294GHMBIFP6F]
data.aws_ami.amazon_linux: Read complete after 2s [id=ami-06eecef118bbf9259]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.api_container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "api_container_definitions" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment       = [
                      + {
                          + name  = "DJANGO_SECRET_KEY"
                          + value = "${django_secret_key}"
                        },
                      + {
                          + name  = "DB_HOST"
                          + value = "${db_host}"
                        },
                      + {
                          + name  = "DB_NAME"
                          + value = "${db_name}"
                        },
                      + {
                          + name  = "DB_USER"
                          + value = "${db_user}"
                        },
                      + {
                          + name  = "DB_PASS"
                          + value = "${db_pass}"
                        },
                      + {
                          + name  = "ALLOWED_HOSTS"
                          + value = "${allowed_hosts}"
                        },
                      + {
                          + name  = "ADMIN_EMAIL"
                          + value = "${admin_email}"
                        },
                      + {
                          + name  = "ADMIN_PASSWORD"
                          + value = "${admin_password}"
                        },
                      + {
                          + name  = "ADMIN"
                          + value = "${admin}"
                        },
                      + {
                          + name  = "S3_STORAGE_BUCKET_NAME"
                          + value = "${s3_storage_bucket_name}"
                        },
                      + {
                          + name  = "S3_STORAGE_BUCKET_REGION"
                          + value = "${s3_storage_bucket_region}"
                        },
                    ]
                  + essential         = true
                  + image             = "${app_image}"
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group_name}"
                          + awslogs-region        = "${log_group_region}"
                          + awslogs-stream-prefix = "api"
                        }
                    }
                  + memoryReservation = 256
                  + mountPoints       = [
                      + {
                          + containerPath = "/vol/web"
                          + readOnly      = false
                          + sourceVolume  = "static"
                        },
                    ]
                  + name              = "api"
                  + portMappings      = [
                      + {
                          + containerPort = 9000
                          + hostPort      = 9000
                        },
                    ]
                },
              + {
                  + environment       = [
                      + {
                          + name  = "APP_HOST"
                          + value = "127.0.0.1"
                        },
                      + {
                          + name  = "APP_PORT"
                          + value = "9000"
                        },
                      + {
                          + name  = "LISTEN_PORT"
                          + value = "8000"
                        },
                    ]
                  + essential         = true
                  + image             = "${proxy_image}"
                  + logConfiguration  = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${log_group_name}"
                          + awslogs-region        = "${log_group_region}"
                          + awslogs-stream-prefix = "proxy"
                        }
                    }
                  + memoryReservation = 256
                  + mountPoints       = [
                      + {
                          + containerPath = "/vol/static"
                          + readOnly      = true
                          + sourceVolume  = "static"
                        },
                    ]
                  + name              = "proxy"
                  + portMappings      = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "admin"                    = "admin"
          + "admin_email"              = "admin@admin.com"
          + "admin_password"           = "secret"
          + "allowed_hosts"            = (known after apply)
          + "app_image"                = "546123287190.dkr.ecr.us-east-1.amazonaws.com/traffic-django-restapi-app:latest"
          + "db_host"                  = (known after apply)
          + "db_name"                  = "traffic"
          + "db_pass"                  = (sensitive)
          + "db_user"                  = "username"
          + "django_secret_key"        = "secret"
          + "log_group_name"           = "traffic-staging-api"
          + "log_group_region"         = "us-east-1"
          + "proxy_image"              = "546123287190.dkr.ecr.us-east-1.amazonaws.com/traffic-django-restapi-proxy:latest"
          + "s3_storage_bucket_name"   = "traffic-staging-bruvio-files"
          + "s3_storage_bucket_region" = "us-east-1"
        }
    }

  # data.template_file.ecs_s3_write_policy will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "ecs_s3_write_policy" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObjectAcl",
                          + "s3:GetObject",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:PutObjectAcl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "${bucket_arn}/*",
                          + "${bucket_arn}",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + vars     = {
          + "bucket_arn" = (known after apply)
        }
    }

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudwatch_log_group.ecs_task_logs will be created
  + resource "aws_cloudwatch_log_group" "ecs_task_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "traffic-staging-api"
      + retention_in_days = 0
      + tags              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
    }

  # aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "traffic-staging-main"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "12.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "traffic-staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = "traffic"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-main"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-main"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + timezone                              = (known after apply)
      + username                              = "username"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "traffic-staging-main"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-main"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-main"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "traffic-staging-cluster"
      + tags               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + cluster                            = "traffic-staging-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "traffic-staging-api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "traffic-staging-api"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "proxy"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.api will be created
  + resource "aws_ecs_task_definition" "api" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "traffic-staging-api"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + task_role_arn            = (known after apply)

      + volume {
          + name = "static"
        }
    }

  # aws_eip.public_a will be created
  + resource "aws_eip" "public_a" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc                  = true
    }

  # aws_eip.public_b will be created
  + resource "aws_eip" "public_b" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc                  = true
    }

  # aws_iam_instance_profile.bastion will be created
  + resource "aws_iam_instance_profile" "bastion" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "traffic-staging-bastion-instance-profile"
      + path        = "/"
      + role        = "traffic-staging-bastion"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.ecs_s3_access will be created
  + resource "aws_iam_policy" "ecs_s3_access" {
      + arn         = (known after apply)
      + description = "Allow access to the traffic app S3 bucket"
      + id          = (known after apply)
      + name        = "traffic-staging-AppS3AccessPolicy"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.task_execution_role_policy will be created
  + resource "aws_iam_policy" "task_execution_role_policy" {
      + arn         = (known after apply)
      + description = "Allow retrieving images and adding to logs"
      + id          = (known after apply)
      + name        = "traffic-staging-task-exec-role-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.app_iam_role will be created
  + resource "aws_iam_role" "app_iam_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "traffic-staging-api-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.bastion will be created
  + resource "aws_iam_role" "bastion" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "traffic-staging-bastion"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "traffic-staging-task-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.bastion_attach_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_attach_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "traffic-staging-bastion"
    }

  # aws_iam_role_policy_attachment.ecs_s3_access will be created
  + resource "aws_iam_role_policy_attachment" "ecs_s3_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "traffic-staging-api-task"
    }

  # aws_iam_role_policy_attachment.task_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "traffic-staging-task-exec-role"
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-06eecef118bbf9259"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "traffic-staging-bastion-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "traffic-app-api-devops-bastion"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-bastion"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-bastion"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "309b35916070e41021dd275e5fba2b9ef4bcbbfa"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-main"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-main"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb.api will be created
  + resource "aws_lb" "api" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "traffic-staging-main"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.api will be created
  + resource "aws_lb_listener" "api" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.api_https will be created
  + resource "aws_lb_listener" "api_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.api will be created
  + resource "aws_lb_target_group" "api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "traffic-staging-api"
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/admin/login/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_nat_gateway.public_a will be created
  + resource "aws_nat_gateway" "public_a" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
    }

  # aws_nat_gateway.public_b will be created
  + resource "aws_nat_gateway" "public_b" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
    }

  # aws_route.private_a_internet_out will be created
  + resource "aws_route" "private_a_internet_out" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_b_internet_out will be created
  + resource "aws_route" "private_b_internet_out" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_internet_access_a will be created
  + resource "aws_route" "public_internet_access_a" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_internet_access_b will be created
  + resource "aws_route" "public_internet_access_b" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route53_record.app will be created
  + resource "aws_route53_record" "app" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.staging.brunoviola.net"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z01104713294GHMBIFP6F"
    }

  # aws_route53_record.cert_validation will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z01104713294GHMBIFP6F"
    }

  # aws_route_table.private_a will be created
  + resource "aws_route_table" "private_a" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private_b will be created
  + resource "aws_route_table" "private_b" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_a will be created
  + resource "aws_route_table" "public_a" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_b will be created
  + resource "aws_route_table" "public_b" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_a will be created
  + resource "aws_route_table_association" "private_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_b will be created
  + resource "aws_route_table_association" "private_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_a will be created
  + resource "aws_route_table_association" "public_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_b will be created
  + resource "aws_route_table_association" "public_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.app_public_files will be created
  + resource "aws_s3_bucket" "app_public_files" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "traffic-staging-bruvio-files"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Control bastion inbound and outbound access"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.1.10.0/24",
                  + "10.1.11.0/24",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "traffic-staging-bastion"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs_service will be created
  + resource "aws_security_group" "ecs_service" {
      + arn                    = (known after apply)
      + description            = "Access for the ECS service"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.1.10.0/24",
                  + "10.1.11.0/24",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = "traffic-staging-ecs-service"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Allow access to Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "traffic-staging-lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Allow access to the RDS database instance."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "traffic-staging-rds-inbound-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private_a will be created
  + resource "aws_subnet" "private_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_b will be created
  + resource "aws_subnet" "private_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-private-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_a will be created
  + resource "aws_subnet" "public_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-a"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_b will be created
  + resource "aws_subnet" "public_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-public-b"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-vpc"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "traffic-staging-vpc"
          + "Owner"       = "bruno.viola@pm.me"
          + "Project"     = "traffic-Django-restAPI-AWS"
        }
    }

Plan: 51 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_endpoint = (known after apply)
  + bastion_host = (known after apply)
  + db_host      = (known after apply)

Warning: Argument is deprecated

  with aws_db_instance.main,
  on database.tf line 34, in resource "aws_db_instance" "main":
  34:   name                    = "traffic"

Use db_name instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pushed by: @bruvio, Action: `pull_request`*